tasks_api/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", ""], ["done", false], ["created_at", "2019-05-10 01:06:51.838800"], ["updated_at", "2019-05-10 01:06:51.838800"]]
---
  def create
    @task = Task.new(task_params)

    if @task.save

UPDATE "tasks" SET "done" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["done", true], ["updated_at", "2019-05-10 01:40:55.879956"], ["id", 10]]
---
  def update
    if @task.update(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 6]]
---
  def destroy
    @task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def set_task
    @task = Task.find(params[:id])